{
  "nav": {
    "profile": "Profile",
    "skills": "Skills",
    "stack": "Stack",
    "blog": "Blog"
  },
  "intro": {
    "greeting": "Hey, I'm Vitor Britto!",
    "description": "I have over 15 years of professional experience in mobile and web application development. I’m passionate about the JavaScript ecosystem and specialize in building scalable, maintainable, and high-performance applications. I focus on delivering clean, tested, and well-documented code — always aiming for simplicity, readability, and real business impact.",
    "linkedin": "Check out my LinkedIn for more information."
  },
  "skills": {
    "title": "Skills",
    "frontend": {
      "title": "Front-end",
      "items": [
        "I have a strong domain of semantic markup, with a focus on accessibility and user experience.",
        "I ensure responsive applications with consistent performance across multiple browsers and devices.",
        "I have hands-on experience with modern SEO techniques and page load optimization.",
        "I'm an advocate for scalable CSS architecture, using tools like Material UI, Tailwind CSS, and Shadcn UI to keep the code clean, modular, and future-proof.",
        "JavaScript has been my primary language for over 15 years. During this time, I've specialized in modern web and mobile apps using React, React Native and Next.js.",
        "I always aim to deliver technical solutions that drive real business impact."
      ]
    },
    "backend": {
      "title": "Back-end",
      "items": [
        "I design and implement robust backend architectures focused on scalability, reliability, and long-term maintainability.",
        "I write production-grade software using object-oriented principles, applying best practices such as SOLID and clean architecture.",
        "I have deep expertise in server-side JavaScript, working extensively with Node.js, Express.js, and NestJS to build APIs and services.",
        "I  have strong knowledge in GraphQL, with experience in schema design, query optimization, and secure API implementation."
      ]
    },
    "databases": {
      "title": "Databases",
      "items": [
        "I have experience with relational and NoSQL databases, including MySQL, PostgreSQL, MongoDB, Redis, DynamoDB, DocumentDB, among others."
      ]
    },
    "devops": {
      "title": "DevOps",
      "items": ["I have solid experience with AWS Services and DevOps."]
    }
  },
  "stack": {
    "title": "Stack",
    "description": "You can check the tools I use here."
  },
  "footer": {
    "copyright": "© Copyright 2025. Powered with ☕ and ❤️."
  },
  "buttons": {
    "schedule": "Schedule a meeting"
  }
}
