{
  "nav": {
    "profile": "Perfil",
    "skills": "Habilidades",
    "stack": "Stack",
    "blog": "Blog"
  },
  "intro": {
    "greeting": "Olá, eu sou Vitor Britto!",
    "description": "Tenho mais de 15 anos de experiência profissional, com especialização em desenvolvimento de aplicações mobile e web. Sou apaixonado por JavaScript e seu ecossistema. Desenvolvo e entrego soluções técnicas de alta qualidade, escrevendo códigos limpos, testados e de fácil manutenção, com forte foco em legibilidade e documentação.",
    "linkedin": "Confira meu LinkedIn para mais informações."
  },
  "skills": {
    "title": "Habilidades",
    "frontend": {
      "title": "Front-end",
      "items": [
        "Tenho forte domínio de marcação semântica, com foco em acessibilidade e experiência do usuário.",
        "Garanto aplicações responsivas com performance consistente em múltiplos navegadores e dispositivos.",
        "Tenho experiência prática com técnicas modernas de SEO e otimização de tempo de carregamento.",
        "Sou adepto de uma arquitetura CSS escalável, utilizando ferramentas como Material UI, Tailwind CSS e Shadcn UI para manter o código limpo, modular e preparado para o futuro.",
        "JavaScript é minha principal linguagem há mais de 15 anos. Nesse tempo, me especializei no desenvolvimento de aplicações web e mobile modernas usando React, React Native e Next.js.",
        "Sempre busco entregar soluções técnicas que gerem impacto real no negócio."
      ]
    },
    "backend": {
      "title": "Back-end",
      "items": [
        "Desenvolvo arquiteturas robustas de back-end com foco em escalabilidade, confiabilidade e manutenção a longo prazo.",
        "Escrevo software de produção aplicando princípios de orientação a objetos, boas práticas como SOLID e arquitetura limpa.",
        "Tenho ampla experiência com JavaScript no lado do servidor, utilizando Node.js, Express.js e NestJS para construir APIs e serviços.",
        "Tenho forte conhecimento em GraphQL, com experiência em design de schemas, otimização de queries e implementação de APIs seguras."
      ]
    },
    "databases": {
      "title": "Bancos de Dados",
      "items": [
        "Tenho experiência em bancos de dados relacionais e NoSQL, incluindo MySQL, PostgreSQL, MongoDB, Redis, DynamoDB, DocumentDB, entre outros."
      ]
    },
    "devops": {
      "title": "DevOps",
      "items": ["Tenho sólida experiência com Serviços AWS e DevOps."]
    }
  },
  "stack": {
    "title": "Stack",
    "description": "Você pode conferir as ferramentas que utilizo aqui."
  },
  "footer": {
    "copyright": "© Copyright 2025. Feito com ☕ e ❤️."
  },
  "buttons": {
    "schedule": "Agendar reunião"
  }
}
